RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_reg.h
/* 0x14 : draw_partial_x_config1 */
#define OSD_DRAW_PARTIAL_X_CONFIG1_OFFSET (0x14)
#define OSD_REG_DRAW_X_MIN_01             OSD_REG_DRAW_X_MIN_01
#define OSD_REG_DRAW_X_MIN_01_POS         (0U)
#define OSD_REG_DRAW_X_MIN_01_LEN         (11U)
#define OSD_REG_DRAW_X_MIN_01_MSK         (((1U << OSD_REG_DRAW_X_MIN_01_LEN) - 1) << OSD_REG_DRAW_X_MIN_01_POS)
#define OSD_REG_DRAW_X_MIN_01_UMSK        (~(((1U << OSD_REG_DRAW_X_MIN_01_LEN) - 1) << OSD_REG_DRAW_X_MIN_01_POS))
#define OSD_REG_DRAW_X_MAX_01             OSD_REG_DRAW_X_MAX_01
#define OSD_REG_DRAW_X_MAX_01_POS         (16U)
#define OSD_REG_DRAW_X_MAX_01_LEN         (11U)
#define OSD_REG_DRAW_X_MAX_01_MSK         (((1U << OSD_REG_DRAW_X_MAX_01_LEN) - 1) << OSD_REG_DRAW_X_MAX_01_POS)
#define OSD_REG_DRAW_X_MAX_01_UMSK        (~(((1U << OSD_REG_DRAW_X_MAX_01_LEN) - 1) << OSD_REG_DRAW_X_MAX_01_POS))

/* 0x18 : draw_partial_y_config1 */
#define OSD_DRAW_PARTIAL_Y_CONFIG1_OFFSET (0x18)
#define OSD_REG_DRAW_Y_MIN_01             OSD_REG_DRAW_Y_MIN_01
#define OSD_REG_DRAW_Y_MIN_01_POS         (0U)
#define OSD_REG_DRAW_Y_MIN_01_LEN         (11U)
#define OSD_REG_DRAW_Y_MIN_01_MSK         (((1U << OSD_REG_DRAW_Y_MIN_01_LEN) - 1) << OSD_REG_DRAW_Y_MIN_01_POS)
#define OSD_REG_DRAW_Y_MIN_01_UMSK        (~(((1U << OSD_REG_DRAW_Y_MIN_01_LEN) - 1) << OSD_REG_DRAW_Y_MIN_01_POS))
#define OSD_REG_DRAW_Y_MAX_01             OSD_REG_DRAW_Y_MAX_01
#define OSD_REG_DRAW_Y_MAX_01_POS         (16U)
#define OSD_REG_DRAW_Y_MAX_01_LEN         (11U)
#define OSD_REG_DRAW_Y_MAX_01_MSK         (((1U << OSD_REG_DRAW_Y_MAX_01_LEN) - 1) << OSD_REG_DRAW_Y_MAX_01_POS)
#define OSD_REG_DRAW_Y_MAX_01_UMSK        (~(((1U << OSD_REG_DRAW_Y_MAX_01_LEN) - 1) << OSD_REG_DRAW_Y_MAX_01_POS))

/* 0x1C : draw_partial_yuv_config2 */
#define OSD_DRAW_PARTIAL_YUV_CONFIG2_OFFSET (0x1C)
#define OSD_REG_DRAW_TH_02                  OSD_REG_DRAW_TH_02
#define OSD_REG_DRAW_TH_02_POS              (0U)
#define OSD_REG_DRAW_TH_02_LEN              (8U)
#define OSD_REG_DRAW_TH_02_MSK              (((1U << OSD_REG_DRAW_TH_02_LEN) - 1) << OSD_REG_DRAW_TH_02_POS)
#define OSD_REG_DRAW_TH_02_UMSK             (~(((1U << OSD_REG_DRAW_TH_02_LEN) - 1) << OSD_REG_DRAW_TH_02_POS))
#define OSD_REG_DRAW_V_02                   OSD_REG_DRAW_V_02
#define OSD_REG_DRAW_V_02_POS               (8U)
#define OSD_REG_DRAW_V_02_LEN               (8U)
#define OSD_REG_DRAW_V_02_MSK               (((1U << OSD_REG_DRAW_V_02_LEN) - 1) << OSD_REG_DRAW_V_02_POS)
#define OSD_REG_DRAW_V_02_UMSK              (~(((1U << OSD_REG_DRAW_V_02_LEN) - 1) << OSD_REG_DRAW_V_02_POS))
#define OSD_REG_DRAW_U_02                   OSD_REG_DRAW_U_02
#define OSD_REG_DRAW_U_02_POS               (16U)
#define OSD_REG_DRAW_U_02_LEN               (8U)
#define OSD_REG_DRAW_U_02_MSK               (((1U << OSD_REG_DRAW_U_02_LEN) - 1) << OSD_REG_DRAW_U_02_POS)
#define OSD_REG_DRAW_U_02_UMSK              (~(((1U << OSD_REG_DRAW_U_02_LEN) - 1) << OSD_REG_DRAW_U_02_POS))
#define OSD_REG_DRAW_Y_02                   OSD_REG_DRAW_Y_02
#define OSD_REG_DRAW_Y_02_POS               (24U)
#define OSD_REG_DRAW_Y_02_LEN               (8U)
#define OSD_REG_DRAW_Y_02_MSK               (((1U << OSD_REG_DRAW_Y_02_LEN) - 1) << OSD_REG_DRAW_Y_02_POS)
#define OSD_REG_DRAW_Y_02_UMSK              (~(((1U << OSD_REG_DRAW_Y_02_LEN) - 1) << OSD_REG_DRAW_Y_02_POS))

/* 0x20 : draw_partial_x_config2 */
#define OSD_DRAW_PARTIAL_X_CONFIG2_OFFSET (0x20)
#define OSD_REG_DRAW_X_MIN_02             OSD_REG_DRAW_X_MIN_02
#define OSD_REG_DRAW_X_MIN_02_POS         (0U)
#define OSD_REG_DRAW_X_MIN_02_LEN         (11U)
#define OSD_REG_DRAW_X_MIN_02_MSK         (((1U << OSD_REG_DRAW_X_MIN_02_LEN) - 1) << OSD_REG_DRAW_X_MIN_02_POS)
#define OSD_REG_DRAW_X_MIN_02_UMSK        (~(((1U << OSD_REG_DRAW_X_MIN_02_LEN) - 1) << OSD_REG_DRAW_X_MIN_02_POS))
#define OSD_REG_DRAW_X_MAX_02             OSD_REG_DRAW_X_MAX_02
#define OSD_REG_DRAW_X_MAX_02_POS         (16U)
#define OSD_REG_DRAW_X_MAX_02_LEN         (11U)
#define OSD_REG_DRAW_X_MAX_02_MSK         (((1U << OSD_REG_DRAW_X_MAX_02_LEN) - 1) << OSD_REG_DRAW_X_MAX_02_POS)
#define OSD_REG_DRAW_X_MAX_02_UMSK        (~(((1U << OSD_REG_DRAW_X_MAX_02_LEN) - 1) << OSD_REG_DRAW_X_MAX_02_POS))

/* 0x24 : draw_partial_y_config2 */
#define OSD_DRAW_PARTIAL_Y_CONFIG2_OFFSET (0x24)
#define OSD_REG_DRAW_Y_MIN_02             OSD_REG_DRAW_Y_MIN_02
#define OSD_REG_DRAW_Y_MIN_02_POS         (0U)
#define OSD_REG_DRAW_Y_MIN_02_LEN         (11U)
#define OSD_REG_DRAW_Y_MIN_02_MSK         (((1U << OSD_REG_DRAW_Y_MIN_02_LEN) - 1) << OSD_REG_DRAW_Y_MIN_02_POS)
#define OSD_REG_DRAW_Y_MIN_02_UMSK        (~(((1U << OSD_REG_DRAW_Y_MIN_02_LEN) - 1) << OSD_REG_DRAW_Y_MIN_02_POS))
#define OSD_REG_DRAW_Y_MAX_02             OSD_REG_DRAW_Y_MAX_02
#define OSD_REG_DRAW_Y_MAX_02_POS         (16U)
#define OSD_REG_DRAW_Y_MAX_02_LEN         (11U)
#define OSD_REG_DRAW_Y_MAX_02_MSK         (((1U << OSD_REG_DRAW_Y_MAX_02_LEN) - 1) << OSD_REG_DRAW_Y_MAX_02_POS)
#define OSD_REG_DRAW_Y_MAX_02_UMSK        (~(((1U << OSD_REG_DRAW_Y_MAX_02_LEN) - 1) << OSD_REG_DRAW_Y_MAX_02_POS))

/* 0x28 : draw_partial_yuv_config3 */
#define OSD_DRAW_PARTIAL_YUV_CONFIG3_OFFSET (0x28)
#define OSD_REG_DRAW_TH_03                  OSD_REG_DRAW_TH_03
#define OSD_REG_DRAW_TH_03_POS              (0U)
#define OSD_REG_DRAW_TH_03_LEN              (8U)
#define OSD_REG_DRAW_TH_03_MSK              (((1U << OSD_REG_DRAW_TH_03_LEN) - 1) << OSD_REG_DRAW_TH_03_POS)
#define OSD_REG_DRAW_TH_03_UMSK             (~(((1U << OSD_REG_DRAW_TH_03_LEN) - 1) << OSD_REG_DRAW_TH_03_POS))
#define OSD_REG_DRAW_V_03                   OSD_REG_DRAW_V_03
#define OSD_REG_DRAW_V_03_POS               (8U)
#define OSD_REG_DRAW_V_03_LEN               (8U)
#define OSD_REG_DRAW_V_03_MSK               (((1U << OSD_REG_DRAW_V_03_LEN) - 1) << OSD_REG_DRAW_V_03_POS)
#define OSD_REG_DRAW_V_03_UMSK              (~(((1U << OSD_REG_DRAW_V_03_LEN) - 1) << OSD_REG_DRAW_V_03_POS))
#define OSD_REG_DRAW_U_03                   OSD_REG_DRAW_U_03
#define OSD_REG_DRAW_U_03_POS               (16U)
#define OSD_REG_DRAW_U_03_LEN               (8U)
#define OSD_REG_DRAW_U_03_MSK               (((1U << OSD_REG_DRAW_U_03_LEN) - 1) << OSD_REG_DRAW_U_03_POS)
#define OSD_REG_DRAW_U_03_UMSK              (~(((1U << OSD_REG_DRAW_U_03_LEN) - 1) << OSD_REG_DRAW_U_03_POS))
#define OSD_REG_DRAW_Y_03                   OSD_REG_DRAW_Y_03
#define OSD_REG_DRAW_Y_03_POS               (24U)
#define OSD_REG_DRAW_Y_03_LEN               (8U)
#define OSD_REG_DRAW_Y_03_MSK               (((1U << OSD_REG_DRAW_Y_03_LEN) - 1) << OSD_REG_DRAW_Y_03_POS)
#define OSD_REG_DRAW_Y_03_UMSK              (~(((1U << OSD_REG_DRAW_Y_03_LEN) - 1) << OSD_REG_DRAW_Y_03_POS))

/* 0x2C : draw_partial_x_config3 */
#define OSD_DRAW_PARTIAL_X_CONFIG3_OFFSET (0x2C)
#define OSD_REG_DRAW_X_MIN_03             OSD_REG_DRAW_X_MIN_03
#define OSD_REG_DRAW_X_MIN_03_POS         (0U)
#define OSD_REG_DRAW_X_MIN_03_LEN         (11U)
#define OSD_REG_DRAW_X_MIN_03_MSK         (((1U << OSD_REG_DRAW_X_MIN_03_LEN) - 1) << OSD_REG_DRAW_X_MIN_03_POS)
#define OSD_REG_DRAW_X_MIN_03_UMSK        (~(((1U << OSD_REG_DRAW_X_MIN_03_LEN) - 1) << OSD_REG_DRAW_X_MIN_03_POS))
#define OSD_REG_DRAW_X_MAX_03             OSD_REG_DRAW_X_MAX_03
#define OSD_REG_DRAW_X_MAX_03_POS         (16U)
#define OSD_REG_DRAW_X_MAX_03_LEN         (11U)
#define OSD_REG_DRAW_X_MAX_03_MSK         (((1U << OSD_REG_DRAW_X_MAX_03_LEN) - 1) << OSD_REG_DRAW_X_MAX_03_POS)
#define OSD_REG_DRAW_X_MAX_03_UMSK        (~(((1U << OSD_REG_DRAW_X_MAX_03_LEN) - 1) << OSD_REG_DRAW_X_MAX_03_POS))

/* 0x30 : draw_partial_y_config3 */
#define OSD_DRAW_PARTIAL_Y_CONFIG3_OFFSET (0x30)
#define OSD_REG_DRAW_Y_MIN_03             OSD_REG_DRAW_Y_MIN_03
#define OSD_REG_DRAW_Y_MIN_03_POS         (0U)
#define OSD_REG_DRAW_Y_MIN_03_LEN         (11U)
#define OSD_REG_DRAW_Y_MIN_03_MSK         (((1U << OSD_REG_DRAW_Y_MIN_03_LEN) - 1) << OSD_REG_DRAW_Y_MIN_03_POS)
#define OSD_REG_DRAW_Y_MIN_03_UMSK        (~(((1U << OSD_REG_DRAW_Y_MIN_03_LEN) - 1) << OSD_REG_DRAW_Y_MIN_03_POS))
#define OSD_REG_DRAW_Y_MAX_03             OSD_REG_DRAW_Y_MAX_03
#define OSD_REG_DRAW_Y_MAX_03_POS         (16U)
#define OSD_REG_DRAW_Y_MAX_03_LEN         (11U)
#define OSD_REG_DRAW_Y_MAX_03_MSK         (((1U << OSD_REG_DRAW_Y_MAX_03_LEN) - 1) << OSD_REG_DRAW_Y_MAX_03_POS)
#define OSD_REG_DRAW_Y_MAX_03_UMSK        (~(((1U << OSD_REG_DRAW_Y_MAX_03_LEN) - 1) << OSD_REG_DRAW_Y_MAX_03_POS))

/* 0x34 : draw_partial_yuv_config4 */
#define OSD_DRAW_PARTIAL_YUV_CONFIG4_OFFSET (0x34)
#define OSD_REG_DRAW_TH_04                  OSD_REG_DRAW_TH_04
#define OSD_REG_DRAW_TH_04_POS              (0U)
#define OSD_REG_DRAW_TH_04_LEN              (8U)
#define OSD_REG_DRAW_TH_04_MSK              (((1U << OSD_REG_DRAW_TH_04_LEN) - 1) << OSD_REG_DRAW_TH_04_POS)
#define OSD_REG_DRAW_TH_04_UMSK             (~(((1U << OSD_REG_DRAW_TH_04_LEN) - 1) << OSD_REG_DRAW_TH_04_POS))
#define OSD_REG_DRAW_V_04                   OSD_REG_DRAW_V_04
#define OSD_REG_DRAW_V_04_POS               (8U)
#define OSD_REG_DRAW_V_04_LEN               (8U)
#define OSD_REG_DRAW_V_04_MSK               (((1U << OSD_REG_DRAW_V_04_LEN) - 1) << OSD_REG_DRAW_V_04_POS)
#define OSD_REG_DRAW_V_04_UMSK              (~(((1U << OSD_REG_DRAW_V_04_LEN) - 1) << OSD_REG_DRAW_V_04_POS))
#define OSD_REG_DRAW_U_04                   OSD_REG_DRAW_U_04
#define OSD_REG_DRAW_U_04_POS               (16U)
#define OSD_REG_DRAW_U_04_LEN               (8U)
#define OSD_REG_DRAW_U_04_MSK               (((1U << OSD_REG_DRAW_U_04_LEN) - 1) << OSD_REG_DRAW_U_04_POS)
#define OSD_REG_DRAW_U_04_UMSK              (~(((1U << OSD_REG_DRAW_U_04_LEN) - 1) << OSD_REG_DRAW_U_04_POS))
#define OSD_REG_DRAW_Y_04                   OSD_REG_DRAW_Y_04
#define OSD_REG_DRAW_Y_04_POS               (24U)
#define OSD_REG_DRAW_Y_04_LEN               (8U)
#define OSD_REG_DRAW_Y_04_MSK               (((1U << OSD_REG_DRAW_Y_04_LEN) - 1) << OSD_REG_DRAW_Y_04_POS)
#define OSD_REG_DRAW_Y_04_UMSK              (~(((1U << OSD_REG_DRAW_Y_04_LEN) - 1) << OSD_REG_DRAW_Y_04_POS))

/* 0x38 : draw_partial_x_config4 */
#define OSD_DRAW_PARTIAL_X_CONFIG4_OFFSET (0x38)
#define OSD_REG_DRAW_X_MIN_04             OSD_REG_DRAW_X_MIN_04
#define OSD_REG_DRAW_X_MIN_04_POS         (0U)
#define OSD_REG_DRAW_X_MIN_04_LEN         (11U)
#define OSD_REG_DRAW_X_MIN_04_MSK         (((1U << OSD_REG_DRAW_X_MIN_04_LEN) - 1) << OSD_REG_DRAW_X_MIN_04_POS)
#define OSD_REG_DRAW_X_MIN_04_UMSK        (~(((1U << OSD_REG_DRAW_X_MIN_04_LEN) - 1) << OSD_REG_DRAW_X_MIN_04_POS))
#define OSD_REG_DRAW_X_MAX_04             OSD_REG_DRAW_X_MAX_04
#define OSD_REG_DRAW_X_MAX_04_POS         (16U)
#define OSD_REG_DRAW_X_MAX_04_LEN         (11U)
#define OSD_REG_DRAW_X_MAX_04_MSK         (((1U << OSD_REG_DRAW_X_MAX_04_LEN) - 1) << OSD_REG_DRAW_X_MAX_04_POS)
#define OSD_REG_DRAW_X_MAX_04_UMSK        (~(((1U << OSD_REG_DRAW_X_MAX_04_LEN) - 1) << OSD_REG_DRAW_X_MAX_04_POS))

/* 0x3C : draw_partial_y_config4 */
#define OSD_DRAW_PARTIAL_Y_CONFIG4_OFFSET (0x3C)
#define OSD_REG_DRAW_Y_MIN_04             OSD_REG_DRAW_Y_MIN_04
#define OSD_REG_DRAW_Y_MIN_04_POS         (0U)
#define OSD_REG_DRAW_Y_MIN_04_LEN         (11U)
#define OSD_REG_DRAW_Y_MIN_04_MSK         (((1U << OSD_REG_DRAW_Y_MIN_04_LEN) - 1) << OSD_REG_DRAW_Y_MIN_04_POS)
#define OSD_REG_DRAW_Y_MIN_04_UMSK        (~(((1U << OSD_REG_DRAW_Y_MIN_04_LEN) - 1) << OSD_REG_DRAW_Y_MIN_04_POS))
#define OSD_REG_DRAW_Y_MAX_04             OSD_REG_DRAW_Y_MAX_04
#define OSD_REG_DRAW_Y_MAX_04_POS         (16U)
#define OSD_REG_DRAW_Y_MAX_04_LEN         (11U)
#define OSD_REG_DRAW_Y_MAX_04_MSK         (((1U << OSD_REG_DRAW_Y_MAX_04_LEN) - 1) << OSD_REG_DRAW_Y_MAX_04_POS)
#define OSD_REG_DRAW_Y_MAX_04_UMSK        (~(((1U << OSD_REG_DRAW_Y_MAX_04_LEN) - 1) << OSD_REG_DRAW_Y_MAX_04_POS))

/* 0x40 : draw_partial_yuv_config5 */
#define OSD_DRAW_PARTIAL_YUV_CONFIG5_OFFSET (0x40)
#define OSD_REG_DRAW_TH_05                  OSD_REG_DRAW_TH_05
#define OSD_REG_DRAW_TH_05_POS              (0U)
#define OSD_REG_DRAW_TH_05_LEN              (8U)
#define OSD_REG_DRAW_TH_05_MSK              (((1U << OSD_REG_DRAW_TH_05_LEN) - 1) << OSD_REG_DRAW_TH_05_POS)
#define OSD_REG_DRAW_TH_05_UMSK             (~(((1U << OSD_REG_DRAW_TH_05_LEN) - 1) << OSD_REG_DRAW_TH_05_POS))
#define OSD_REG_DRAW_V_05                   OSD_REG_DRAW_V_05
#define OSD_REG_DRAW_V_05_POS               (8U)
#define OSD_REG_DRAW_V_05_LEN               (8U)
#define OSD_REG_DRAW_V_05_MSK               (((1U << OSD_REG_DRAW_V_05_LEN) - 1) << OSD_REG_DRAW_V_05_POS)
#define OSD_REG_DRAW_V_05_UMSK              (~(((1U << OSD_REG_DRAW_V_05_LEN) - 1) << OSD_REG_DRAW_V_05_POS))
#define OSD_REG_DRAW_U_05                   OSD_REG_DRAW_U_05
#define OSD_REG_DRAW_U_05_POS               (16U)
#define OSD_REG_DRAW_U_05_LEN               (8U)
#define OSD_REG_DRAW_U_05_MSK               (((1U << OSD_REG_DRAW_U_05_LEN) - 1) << OSD_REG_DRAW_U_05_POS)
#define OSD_REG_DRAW_U_05_UMSK              (~(((1U << OSD_REG_DRAW_U_05_LEN) - 1) << OSD_REG_DRAW_U_05_POS))
#define OSD_REG_DRAW_Y_05                   OSD_REG_DRAW_Y_05
#define OSD_REG_DRAW_Y_05_POS               (24U)
#define OSD_REG_DRAW_Y_05_LEN               (8U)
#define OSD_REG_DRAW_Y_05_MSK               (((1U << OSD_REG_DRAW_Y_05_LEN) - 1) << OSD_REG_DRAW_Y_05_POS)
#define OSD_REG_DRAW_Y_05_UMSK              (~(((1U << OSD_REG_DRAW_Y_05_LEN) - 1) << OSD_REG_DRAW_Y_05_POS))

/* 0x44 : draw_partial_x_config5 */
#define OSD_DRAW_PARTIAL_X_CONFIG5_OFFSET (0x44)
#define OSD_REG_DRAW_X_MIN_05             OSD_REG_DRAW_X_MIN_05
#define OSD_REG_DRAW_X_MIN_05_POS         (0U)
#define OSD_REG_DRAW_X_MIN_05_LEN         (11U)
#define OSD_REG_DRAW_X_MIN_05_MSK         (((1U << OSD_REG_DRAW_X_MIN_05_LEN) - 1) << OSD_REG_DRAW_X_MIN_05_POS)
#define OSD_REG_DRAW_X_MIN_05_UMSK        (~(((1U << OSD_REG_DRAW_X_MIN_05_LEN) - 1) << OSD_REG_DRAW_X_MIN_05_POS))
#define OSD_REG_DRAW_X_MAX_05             OSD_REG_DRAW_X_MAX_05
#define OSD_REG_DRAW_X_MAX_05_POS         (16U)
#define OSD_REG_DRAW_X_MAX_05_LEN         (11U)
#define OSD_REG_DRAW_X_MAX_05_MSK         (((1U << OSD_REG_DRAW_X_MAX_05_LEN) - 1) << OSD_REG_DRAW_X_MAX_05_POS)
#define OSD_REG_DRAW_X_MAX_05_UMSK        (~(((1U << OSD_REG_DRAW_X_MAX_05_LEN) - 1) << OSD_REG_DRAW_X_MAX_05_POS))

/* 0x48 : draw_partial_y_config5 */
#define OSD_DRAW_PARTIAL_Y_CONFIG5_OFFSET (0x48)
#define OSD_REG_DRAW_Y_MIN_05             OSD_REG_DRAW_Y_MIN_05
#define OSD_REG_DRAW_Y_MIN_05_POS         (0U)
#define OSD_REG_DRAW_Y_MIN_05_LEN         (11U)
#define OSD_REG_DRAW_Y_MIN_05_MSK         (((1U << OSD_REG_DRAW_Y_MIN_05_LEN) - 1) << OSD_REG_DRAW_Y_MIN_05_POS)
#define OSD_REG_DRAW_Y_MIN_05_UMSK        (~(((1U << OSD_REG_DRAW_Y_MIN_05_LEN) - 1) << OSD_REG_DRAW_Y_MIN_05_POS))
#define OSD_REG_DRAW_Y_MAX_05             OSD_REG_DRAW_Y_MAX_05
#define OSD_REG_DRAW_Y_MAX_05_POS         (16U)
#define OSD_REG_DRAW_Y_MAX_05_LEN         (11U)
#define OSD_REG_DRAW_Y_MAX_05_MSK         (((1U << OSD_REG_DRAW_Y_MAX_05_LEN) - 1) << OSD_REG_DRAW_Y_MAX_05_POS)
#define OSD_REG_DRAW_Y_MAX_05_UMSK        (~(((1U << OSD_REG_DRAW_Y_MAX_05_LEN) - 1) << OSD_REG_DRAW_Y_MAX_05_POS))

