RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_reg.h
/* 0xBC : draw_partial_x_configf */
#define OSD_DRAW_PARTIAL_X_CONFIGF_OFFSET (0xBC)
#define OSD_REG_DRAW_X_MIN_0F             OSD_REG_DRAW_X_MIN_0F
#define OSD_REG_DRAW_X_MIN_0F_POS         (0U)
#define OSD_REG_DRAW_X_MIN_0F_LEN         (11U)
#define OSD_REG_DRAW_X_MIN_0F_MSK         (((1U << OSD_REG_DRAW_X_MIN_0F_LEN) - 1) << OSD_REG_DRAW_X_MIN_0F_POS)
#define OSD_REG_DRAW_X_MIN_0F_UMSK        (~(((1U << OSD_REG_DRAW_X_MIN_0F_LEN) - 1) << OSD_REG_DRAW_X_MIN_0F_POS))
#define OSD_REG_DRAW_X_MAX_0F             OSD_REG_DRAW_X_MAX_0F
#define OSD_REG_DRAW_X_MAX_0F_POS         (16U)
#define OSD_REG_DRAW_X_MAX_0F_LEN         (11U)
#define OSD_REG_DRAW_X_MAX_0F_MSK         (((1U << OSD_REG_DRAW_X_MAX_0F_LEN) - 1) << OSD_REG_DRAW_X_MAX_0F_POS)
#define OSD_REG_DRAW_X_MAX_0F_UMSK        (~(((1U << OSD_REG_DRAW_X_MAX_0F_LEN) - 1) << OSD_REG_DRAW_X_MAX_0F_POS))

/* 0xC0 : draw_partial_y_configf */
#define OSD_DRAW_PARTIAL_Y_CONFIGF_OFFSET (0xC0)
#define OSD_REG_DRAW_Y_MIN_0F             OSD_REG_DRAW_Y_MIN_0F
#define OSD_REG_DRAW_Y_MIN_0F_POS         (0U)
#define OSD_REG_DRAW_Y_MIN_0F_LEN         (11U)
#define OSD_REG_DRAW_Y_MIN_0F_MSK         (((1U << OSD_REG_DRAW_Y_MIN_0F_LEN) - 1) << OSD_REG_DRAW_Y_MIN_0F_POS)
#define OSD_REG_DRAW_Y_MIN_0F_UMSK        (~(((1U << OSD_REG_DRAW_Y_MIN_0F_LEN) - 1) << OSD_REG_DRAW_Y_MIN_0F_POS))
#define OSD_REG_DRAW_Y_MAX_0F             OSD_REG_DRAW_Y_MAX_0F
#define OSD_REG_DRAW_Y_MAX_0F_POS         (16U)
#define OSD_REG_DRAW_Y_MAX_0F_LEN         (11U)
#define OSD_REG_DRAW_Y_MAX_0F_MSK         (((1U << OSD_REG_DRAW_Y_MAX_0F_LEN) - 1) << OSD_REG_DRAW_Y_MAX_0F_POS)
#define OSD_REG_DRAW_Y_MAX_0F_UMSK        (~(((1U << OSD_REG_DRAW_Y_MAX_0F_LEN) - 1) << OSD_REG_DRAW_Y_MAX_0F_POS))

/* 0xF8 : osd_int_sts */
#define OSD_DRAW_INT_STS_OFFSET           (0xF8)
#define OSD_DRAW_REG_SEOF_INT_CLR_W       OSD_DRAW_REG_SEOF_INT_CLR_W
#define OSD_DRAW_REG_SEOF_INT_CLR_W_POS   (0U)
#define OSD_DRAW_REG_SEOF_INT_CLR_W_LEN   (1U)
#define OSD_DRAW_REG_SEOF_INT_CLR_W_MSK   (((1U << OSD_DRAW_REG_SEOF_INT_CLR_W_LEN) - 1) << OSD_DRAW_REG_SEOF_INT_CLR_W_POS)
#define OSD_DRAW_REG_SEOF_INT_CLR_W_UMSK  (~(((1U << OSD_DRAW_REG_SEOF_INT_CLR_W_LEN) - 1) << OSD_DRAW_REG_SEOF_INT_CLR_W_POS))
#define OSD_DRAW_REG_SEOF_INT_MASK_W      OSD_DRAW_REG_SEOF_INT_MASK_W
#define OSD_DRAW_REG_SEOF_INT_MASK_W_POS  (1U)
#define OSD_DRAW_REG_SEOF_INT_MASK_W_LEN  (1U)
#define OSD_DRAW_REG_SEOF_INT_MASK_W_MSK  (((1U << OSD_DRAW_REG_SEOF_INT_MASK_W_LEN) - 1) << OSD_DRAW_REG_SEOF_INT_MASK_W_POS)
#define OSD_DRAW_REG_SEOF_INT_MASK_W_UMSK (~(((1U << OSD_DRAW_REG_SEOF_INT_MASK_W_LEN) - 1) << OSD_DRAW_REG_SEOF_INT_MASK_W_POS))
#define OSD_DRAW_REG_SEOF_INT_EDGE_W      OSD_DRAW_REG_SEOF_INT_EDGE_W
#define OSD_DRAW_REG_SEOF_INT_EDGE_W_POS  (2U)
#define OSD_DRAW_REG_SEOF_INT_EDGE_W_LEN  (1U)
#define OSD_DRAW_REG_SEOF_INT_EDGE_W_MSK  (((1U << OSD_DRAW_REG_SEOF_INT_EDGE_W_LEN) - 1) << OSD_DRAW_REG_SEOF_INT_EDGE_W_POS)
#define OSD_DRAW_REG_SEOF_INT_EDGE_W_UMSK (~(((1U << OSD_DRAW_REG_SEOF_INT_EDGE_W_LEN) - 1) << OSD_DRAW_REG_SEOF_INT_EDGE_W_POS))
#define OSD_DRAW_STS_DRAIN_INT_R          OSD_DRAW_STS_DRAIN_INT_R
#define OSD_DRAW_STS_DRAIN_INT_R_POS      (16U)
#define OSD_DRAW_STS_DRAIN_INT_R_LEN      (4U)
#define OSD_DRAW_STS_DRAIN_INT_R_MSK      (((1U << OSD_DRAW_STS_DRAIN_INT_R_LEN) - 1) << OSD_DRAW_STS_DRAIN_INT_R_POS)
#define OSD_DRAW_STS_DRAIN_INT_R_UMSK     (~(((1U << OSD_DRAW_STS_DRAIN_INT_R_LEN) - 1) << OSD_DRAW_STS_DRAIN_INT_R_POS))
#define OSD_DRAW_STS_SEOF_INT_R           OSD_DRAW_STS_SEOF_INT_R
#define OSD_DRAW_STS_SEOF_INT_R_POS       (20U)
#define OSD_DRAW_STS_SEOF_INT_R_LEN       (1U)
#define OSD_DRAW_STS_SEOF_INT_R_MSK       (((1U << OSD_DRAW_STS_SEOF_INT_R_LEN) - 1) << OSD_DRAW_STS_SEOF_INT_R_POS)
#define OSD_DRAW_STS_SEOF_INT_R_UMSK      (~(((1U << OSD_DRAW_STS_SEOF_INT_R_LEN) - 1) << OSD_DRAW_STS_SEOF_INT_R_POS))

/* 0xFC : osd_misc */
#define OSD_DRAW_MISC_OFFSET              (0xFC)
#define OSD_DRAW_REG_BUS_STRT_W           OSD_DRAW_REG_BUS_STRT_W
#define OSD_DRAW_REG_BUS_STRT_W_POS       (0U)
#define OSD_DRAW_REG_BUS_STRT_W_LEN       (1U)
#define OSD_DRAW_REG_BUS_STRT_W_MSK       (((1U << OSD_DRAW_REG_BUS_STRT_W_LEN) - 1) << OSD_DRAW_REG_BUS_STRT_W_POS)
#define OSD_DRAW_REG_BUS_STRT_W_UMSK      (~(((1U << OSD_DRAW_REG_BUS_STRT_W_LEN) - 1) << OSD_DRAW_REG_BUS_STRT_W_POS))
#define OSD_DRAW_REG_FIFO_AUTO_CLR_W      OSD_DRAW_REG_FIFO_AUTO_CLR_W
#define OSD_DRAW_REG_FIFO_AUTO_CLR_W_POS  (1U)
#define OSD_DRAW_REG_FIFO_AUTO_CLR_W_LEN  (1U)
#define OSD_DRAW_REG_FIFO_AUTO_CLR_W_MSK  (((1U << OSD_DRAW_REG_FIFO_AUTO_CLR_W_LEN) - 1) << OSD_DRAW_REG_FIFO_AUTO_CLR_W_POS)
#define OSD_DRAW_REG_FIFO_AUTO_CLR_W_UMSK (~(((1U << OSD_DRAW_REG_FIFO_AUTO_CLR_W_LEN) - 1) << OSD_DRAW_REG_FIFO_AUTO_CLR_W_POS))
#define OSD_DRAW_REG_QOS_SW_MODE_W        OSD_DRAW_REG_QOS_SW_MODE_W
#define OSD_DRAW_REG_QOS_SW_MODE_W_POS    (4U)
#define OSD_DRAW_REG_QOS_SW_MODE_W_LEN    (1U)
#define OSD_DRAW_REG_QOS_SW_MODE_W_MSK    (((1U << OSD_DRAW_REG_QOS_SW_MODE_W_LEN) - 1) << OSD_DRAW_REG_QOS_SW_MODE_W_POS)
#define OSD_DRAW_REG_QOS_SW_MODE_W_UMSK   (~(((1U << OSD_DRAW_REG_QOS_SW_MODE_W_LEN) - 1) << OSD_DRAW_REG_QOS_SW_MODE_W_POS))
#define OSD_DRAW_REG_QOS_SW_W             OSD_DRAW_REG_QOS_SW_W
#define OSD_DRAW_REG_QOS_SW_W_POS         (5U)
#define OSD_DRAW_REG_QOS_SW_W_LEN         (1U)
#define OSD_DRAW_REG_QOS_SW_W_MSK         (((1U << OSD_DRAW_REG_QOS_SW_W_LEN) - 1) << OSD_DRAW_REG_QOS_SW_W_POS)
#define OSD_DRAW_REG_QOS_SW_W_UMSK        (~(((1U << OSD_DRAW_REG_QOS_SW_W_LEN) - 1) << OSD_DRAW_REG_QOS_SW_W_POS))
#define OSD_DRAW_REG_OSTD_MAX_W           OSD_DRAW_REG_OSTD_MAX_W
#define OSD_DRAW_REG_OSTD_MAX_W_POS       (8U)
#define OSD_DRAW_REG_OSTD_MAX_W_LEN       (2U)
#define OSD_DRAW_REG_OSTD_MAX_W_MSK       (((1U << OSD_DRAW_REG_OSTD_MAX_W_LEN) - 1) << OSD_DRAW_REG_OSTD_MAX_W_POS)
#define OSD_DRAW_REG_OSTD_MAX_W_UMSK      (~(((1U << OSD_DRAW_REG_OSTD_MAX_W_LEN) - 1) << OSD_DRAW_REG_OSTD_MAX_W_POS))
#define OSD_DRAW_REG_XLEN_W               OSD_DRAW_REG_XLEN_W
#define OSD_DRAW_REG_XLEN_W_POS           (12U)
#define OSD_DRAW_REG_XLEN_W_LEN           (3U)
#define OSD_DRAW_REG_XLEN_W_MSK           (((1U << OSD_DRAW_REG_XLEN_W_LEN) - 1) << OSD_DRAW_REG_XLEN_W_POS)
#define OSD_DRAW_REG_XLEN_W_UMSK          (~(((1U << OSD_DRAW_REG_XLEN_W_LEN) - 1) << OSD_DRAW_REG_XLEN_W_POS))
#define OSD_DRAW_STS_L0_CMD_IDLE_R        OSD_DRAW_STS_L0_CMD_IDLE_R
#define OSD_DRAW_STS_L0_CMD_IDLE_R_POS    (16U)
#define OSD_DRAW_STS_L0_CMD_IDLE_R_LEN    (1U)
#define OSD_DRAW_STS_L0_CMD_IDLE_R_MSK    (((1U << OSD_DRAW_STS_L0_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L0_CMD_IDLE_R_POS)
#define OSD_DRAW_STS_L0_CMD_IDLE_R_UMSK   (~(((1U << OSD_DRAW_STS_L0_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L0_CMD_IDLE_R_POS))
#define OSD_DRAW_STS_L1_CMD_IDLE_R        OSD_DRAW_STS_L1_CMD_IDLE_R
#define OSD_DRAW_STS_L1_CMD_IDLE_R_POS    (17U)
#define OSD_DRAW_STS_L1_CMD_IDLE_R_LEN    (1U)
#define OSD_DRAW_STS_L1_CMD_IDLE_R_MSK    (((1U << OSD_DRAW_STS_L1_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L1_CMD_IDLE_R_POS)
#define OSD_DRAW_STS_L1_CMD_IDLE_R_UMSK   (~(((1U << OSD_DRAW_STS_L1_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L1_CMD_IDLE_R_POS))
#define OSD_DRAW_STS_L2_CMD_IDLE_R        OSD_DRAW_STS_L2_CMD_IDLE_R
#define OSD_DRAW_STS_L2_CMD_IDLE_R_POS    (18U)
#define OSD_DRAW_STS_L2_CMD_IDLE_R_LEN    (1U)
#define OSD_DRAW_STS_L2_CMD_IDLE_R_MSK    (((1U << OSD_DRAW_STS_L2_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L2_CMD_IDLE_R_POS)
#define OSD_DRAW_STS_L2_CMD_IDLE_R_UMSK   (~(((1U << OSD_DRAW_STS_L2_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L2_CMD_IDLE_R_POS))
#define OSD_DRAW_STS_L3_CMD_IDLE_R        OSD_DRAW_STS_L3_CMD_IDLE_R
#define OSD_DRAW_STS_L3_CMD_IDLE_R_POS    (19U)
#define OSD_DRAW_STS_L3_CMD_IDLE_R_LEN    (1U)
#define OSD_DRAW_STS_L3_CMD_IDLE_R_MSK    (((1U << OSD_DRAW_STS_L3_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L3_CMD_IDLE_R_POS)
#define OSD_DRAW_STS_L3_CMD_IDLE_R_UMSK   (~(((1U << OSD_DRAW_STS_L3_CMD_IDLE_R_LEN) - 1) << OSD_DRAW_STS_L3_CMD_IDLE_R_POS))
#define OSD_DRAW_STS_AXI_IDLE_R           OSD_DRAW_STS_AXI_IDLE_R
#define OSD_DRAW_STS_AXI_IDLE_R_POS       (20U)
#define OSD_DRAW_STS_AXI_IDLE_R_LEN       (1U)
#define OSD_DRAW_STS_AXI_IDLE_R_MSK       (((1U << OSD_DRAW_STS_AXI_IDLE_R_LEN) - 1) << OSD_DRAW_STS_AXI_IDLE_R_POS)
#define OSD_DRAW_STS_AXI_IDLE_R_UMSK      (~(((1U << OSD_DRAW_STS_AXI_IDLE_R_LEN) - 1) << OSD_DRAW_STS_AXI_IDLE_R_POS))
#define OSD_DRAW_REG_PCLK_FORCE_ON_W      OSD_DRAW_REG_PCLK_FORCE_ON_W
#define OSD_DRAW_REG_PCLK_FORCE_ON_W_POS  (24U)
#define OSD_DRAW_REG_PCLK_FORCE_ON_W_LEN  (8U)
#define OSD_DRAW_REG_PCLK_FORCE_ON_W_MSK  (((1U << OSD_DRAW_REG_PCLK_FORCE_ON_W_LEN) - 1) << OSD_DRAW_REG_PCLK_FORCE_ON_W_POS)
#define OSD_DRAW_REG_PCLK_FORCE_ON_W_UMSK (~(((1U << OSD_DRAW_REG_PCLK_FORCE_ON_W_LEN) - 1) << OSD_DRAW_REG_PCLK_FORCE_ON_W_POS))

