RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_reg.h
    /* 0x4C : draw_partial_yuv_config6 */
    union {
        struct {
            uint32_t reg_draw_th_06 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_06  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_06  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_06  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config6;

    /* 0x50 : draw_partial_x_config6 */
    union {
        struct {
            uint32_t reg_draw_x_min_06 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_06 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config6;

    /* 0x54 : draw_partial_y_config6 */
    union {
        struct {
            uint32_t reg_draw_y_min_06 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_06 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config6;

    /* 0x58 : draw_partial_yuv_config7 */
    union {
        struct {
            uint32_t reg_draw_th_07 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_07  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_07  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_07  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config7;

    /* 0x5C : draw_partial_x_config7 */
    union {
        struct {
            uint32_t reg_draw_x_min_07 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_07 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config7;

    /* 0x60 : draw_partial_y_config7 */
    union {
        struct {
            uint32_t reg_draw_y_min_07 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_07 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config7;

    /* 0x64 : draw_partial_yuv_config8 */
    union {
        struct {
            uint32_t reg_draw_th_08 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_08  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_08  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_08  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config8;

    /* 0x68 : draw_partial_x_config8 */
    union {
        struct {
            uint32_t reg_draw_x_min_08 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_08 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config8;

    /* 0x6C : draw_partial_y_config8 */
    union {
        struct {
            uint32_t reg_draw_y_min_08 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_08 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config8;

    /* 0x70 : draw_partial_yuv_config9 */
    union {
        struct {
            uint32_t reg_draw_th_09 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_09  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_09  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_09  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config9;

    /* 0x74 : draw_partial_x_config9 */
    union {
        struct {
            uint32_t reg_draw_x_min_09 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_09 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config9;

    /* 0x78 : draw_partial_y_config9 */
    union {
        struct {
            uint32_t reg_draw_y_min_09 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_09 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config9;

    /* 0x7C : draw_partial_yuv_configa */
    union {
        struct {
            uint32_t reg_draw_th_0a : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_0a  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_0a  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_0a  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_configa;

    /* 0x80 : draw_partial_x_configa */
    union {
        struct {
            uint32_t reg_draw_x_min_0a : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_0a : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_configa;

