RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_reg.h
    /* 0x84 : draw_partial_y_configa */
    union {
        struct {
            uint32_t reg_draw_y_min_0a : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_0a : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_configa;

    /* 0x88 : draw_partial_yuv_configb */
    union {
        struct {
            uint32_t reg_draw_th_0b : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_0b  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_0b  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_0b  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_configb;

    /* 0x8C : draw_partial_x_configb */
    union {
        struct {
            uint32_t reg_draw_x_min_0b : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_0b : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_configb;

    /* 0x90 : draw_partial_y_configb */
    union {
        struct {
            uint32_t reg_draw_y_min_0b : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_0b : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_configb;

    /* 0x94 : draw_partial_yuv_configc */
    union {
        struct {
            uint32_t reg_draw_th_0c : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_0c  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_0c  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_0c  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_configc;

    /* 0x98 : draw_partial_x_configc */
    union {
        struct {
            uint32_t reg_draw_x_min_0c : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_0c : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_configc;

    /* 0x9C : draw_partial_y_configc */
    union {
        struct {
            uint32_t reg_draw_y_min_0c : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_0c : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_configc;

    /* 0xA0 : draw_partial_yuv_configd */
    union {
        struct {
            uint32_t reg_draw_th_0d : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_0d  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_0d  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_0d  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_configd;

    /* 0xA4 : draw_partial_x_configd */
    union {
        struct {
            uint32_t reg_draw_x_min_0d : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_0d : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_configd;

    /* 0xA8 : draw_partial_y_configd */
    union {
        struct {
            uint32_t reg_draw_y_min_0d : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_0d : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_configd;

    /* 0xAC : draw_partial_yuv_confige */
    union {
        struct {
            uint32_t reg_draw_th_0e : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_0e  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_0e  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_0e  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_confige;

    /* 0xB0 : draw_partial_x_confige */
    union {
        struct {
            uint32_t reg_draw_x_min_0e : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_0e : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_confige;

    /* 0xB4 : draw_partial_y_confige */
    union {
        struct {
            uint32_t reg_draw_y_min_0e : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_0e : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_confige;

    /* 0xB8 : draw_partial_yuv_configf */
    union {
        struct {
            uint32_t reg_draw_th_0f : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_0f  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_0f  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_0f  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_configf;

