RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_reg.h
    /* 0xBC : draw_partial_x_configf */
    union {
        struct {
            uint32_t reg_draw_x_min_0f : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_0f : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_configf;

    /* 0xC0 : draw_partial_y_configf */
    union {
        struct {
            uint32_t reg_draw_y_min_0f : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_0f : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_configf;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[52];

    /* 0xF8 : osd_int_sts */
    union {
        struct {
            uint32_t reg_seof_int_clr_w  : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg_seof_int_mask_w : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_seof_int_edge_w : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_15       : 13; /* [15: 3],       rsvd,        0x0 */
            uint32_t sts_drain_int_r     : 4;  /* [19:16],          r,        0x0 */
            uint32_t sts_seof_int_r      : 1;  /* [   20],          r,        0x0 */
            uint32_t reserved_21_31      : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_int_sts;

    /* 0xFC : osd_misc */
    union {
        struct {
            uint32_t reg_bus_strt_w      : 1; /* [    0],        w1p,        0x0 */
            uint32_t reg_fifo_auto_clr_w : 1; /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_3        : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t reg_qos_sw_mode_w   : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_qos_sw_w        : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_ostd_max_w      : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t reserved_10_11      : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t reg_xlen_w          : 3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15         : 1; /* [   15],       rsvd,        0x0 */
            uint32_t sts_l0_cmd_idle_r   : 1; /* [   16],          r,        0x0 */
            uint32_t sts_l1_cmd_idle_r   : 1; /* [   17],          r,        0x0 */
            uint32_t sts_l2_cmd_idle_r   : 1; /* [   18],          r,        0x0 */
            uint32_t sts_l3_cmd_idle_r   : 1; /* [   19],          r,        0x0 */
            uint32_t sts_axi_idle_r      : 1; /* [   20],          r,        0x0 */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t reg_pclk_force_on_w : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_misc;
};

typedef volatile struct osd_draw_reg osd_draw_reg_t;

#endif /* __OSD_REG_H__ */
